Revit 2017 API
StructuralSectionRoundHSS.WallDesignThickness Property
 Represents wall design thickness of pipe.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public double WallDesignThickness { get; set; }
Visual Basic
Public Property WallDesignThickness As Double
	Get
	Set
Visual C++
public:
property double WallDesignThickness {
	double get ();
	void set (double value);
}
Remarks
 Design thickness of pipe wall is value should be thinner value than measured real value (nominal).
See Also
StructuralSectionRoundHSS Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace